#створюємо базу книг
database = {
    "Книги для відпочинку": [
        "Зелене світло",
        "Кульбабове вино",
        "Пляжне чтиво",
        "Чоловік на ім'я Уве",
        "Кафе на краю світу"
    ],
    "Мотиваційні": [
        "Як стати успішним за 30 днів",
        "Щурині перегони",
        "Їж, молись, кохай",
        "Генрі Марш. Історія успішного нейрохірурга",
        "Ідеальний код без зусиль"
    ],
    "Детектив": [
        "Шерлок Холмс і Доктор Ватсон",
        "Агата Крісті. Смерть на Нілі",
        "Випадкова вакансія",
        "Людина яка померла двічи",
        "Клуб загадкових вбивств по четвергам"
    ],
    "Триллери": [
        "Моє життя",
        "Сніговик",
        "Привид",
        "Темний ліс",
        "Дім, в якому..."
    ],
    "Історичні": [
        "І будуть люди..",
        "Сад Гетсиманський",
        "Імя рози",
        "Ярмарок марнославства",
        "Знедолені"
    ],
    "Психологічні": [
        "1984",
        "Маленькі жінки",
        "І всюди тліють пожежі",
        "Несказане",
        "Тривожні люди"
    ],
}
# Запитуємо у користувача книжковий жанр
genre = input("Який книжковий жанр вас цікавить? ")
# Перевіряємо, чи жанр є у базі книг
if genre in database:
    print("Список книг у жанрі", genre, ":")
    for book in database[genre]:
        print(book)
else:
    print("Жанр", genre, "не знайдений у базі даних.")