#створюємо базу книг
database = {
    "Книги для відпочинку": [
        "Зелене світло",
        "Кульбабове вино",
        "Пляжне чтиво",
        "Чоловік на ім'я Уве",
        "Кафе на краю світу"
    ],
    "Мотиваційні": [
        "Як стати успішним за 30 днів",
        "Щурині перегони",
        "Їж, молись, кохай",
        "Генрі Марш. Історія успішного нейрохірурга",
        "Ідеальний код без зусиль"
    ],
    "Детектив": [
        "Шерлок Холмс і Доктор Ватсон",
        "Агата Крісті. Смерть на Нілі",
        "Випадкова вакансія",
        "Людина яка померла двічи",
        "Клуб загадкових вбивств по четвергам"
    ],
    "Триллери": [
        "Моє життя",
        "Сніговик",
        "Привид",
        "Темний ліс",
        "Дім, в якому..."
    ],
    "Історичні": [
        "І будуть люди..",
        "Сад Гетсиманський",
        "Імя рози",
        "Ярмарок марнославства",
        "Знедолені"
    ],
    "Психологічні": [
        "1984",
        "Маленькі жінки",
        "І всюди тліють пожежі",
        "Несказане",
        "Тривожні люди"
    ],
}
# Головний цикл програми
while True:
    # Виводимо доступні дії
    print("Виберіть дію:")
    print("1. Вивести список всіх доступних книг")
    print("2. Додати книгу")
    print("3. Видалити книгу")
    print("4. Вийти")

    # Користувач вводить номер дії
    choice = int(input("Ваш вибір: "))

    if choice == 1:  # Якщо обрана дія - вивести список всіх доступних книг
        print("Список всіх доступних книг:")
        for genre, books in database.items():
            print(genre + ":")
            for i, book in enumerate(books, start=1):
                print(f"{i}. {book}")
            print()
    elif choice == 4:  # Якщо обрана дія - вийти
        print("До побачення!")
        break
    else:
        print("Некоректний вибір дії.")
